#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/client/C_PointEntity.hpp"
#include "source2sdk/client/C_SceneEntity_QueuedEvents_t.hpp"
namespace source2sdk
{
    namespace client
    {
        struct C_BaseModelEntity;
    };
};

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace client
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x668
        // Has VTable
        // Construct allowed
        #pragma pack(push, 1)
        class C_SceneEntity : public source2sdk::client::C_PointEntity
        {
        public:
            uint8_t _pad0600[0x8]; // 0x600
            // metadata: MNotSaved
            bool m_bIsPlayingBack; // 0x608            
            // metadata: MNotSaved
            bool m_bPaused; // 0x609            
            // metadata: MNotSaved
            bool m_bMultiplayer; // 0x60a            
            // metadata: MNotSaved
            bool m_bAutogenerated; // 0x60b            
            // metadata: MNotSaved
            bool m_bAllRequirementsComplete; // 0x60c            
            uint8_t _pad060d[0x3]; // 0x60d
            // metadata: MNotSaved
            float m_flForceClientTime; // 0x610            
            // metadata: MNotSaved
            std::uint16_t m_nSceneStringIndex; // 0x614            
            // metadata: MNotSaved
            bool m_bClientOnly; // 0x616            
            uint8_t _pad0617[0x1]; // 0x617
            // metadata: MNotSaved
            // m_hOwner has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::client::C_BaseModelEntity> m_hOwner;
            char m_hOwner[0x4]; // 0x618            
            uint8_t _pad061c[0x4]; // 0x61c
            // metadata: MNotSaved
            // m_hActorList has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // C_NetworkUtlVectorBase<CHandle<source2sdk::client::C_BaseModelEntity>> m_hActorList;
            char m_hActorList[0x18]; // 0x620            
            // metadata: MNotSaved
            bool m_bWasPlaying; // 0x638            
            uint8_t _pad0639[0xf]; // 0x639
            // metadata: MNotSaved
            // m_QueuedEvents has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<source2sdk::client::C_SceneEntity_QueuedEvents_t> m_QueuedEvents;
            char m_QueuedEvents[0x18]; // 0x648            
            // metadata: MNotSaved
            float m_flCurrentTime; // 0x660            
            uint8_t _pad0664[0x4];
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in C_SceneEntity because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::client::C_SceneEntity) == 0x668);
    };
};
