#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/client/C_PointEntity.hpp"

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace client
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x630
        // Has VTable
        // Construct allowed
        // MClassHasEntityLimitedDataDesc
        #pragma pack(push, 1)
        class CMapInfo : public source2sdk::client::C_PointEntity
        {
        public:
            std::int32_t m_iBuyingStatus; // 0x600            
            float m_flBombRadius; // 0x604            
            std::int32_t m_iPetPopulation; // 0x608            
            bool m_bUseNormalSpawnsForDM; // 0x60c            
            bool m_bDisableAutoGeneratedDMSpawns; // 0x60d            
            uint8_t _pad060e[0x2]; // 0x60e
            float m_flBotMaxVisionDistance; // 0x610            
            std::int32_t m_iHostageCount; // 0x614            
            bool m_bFadePlayerVisibilityFarZ; // 0x618            
            bool m_bRainTraceToSkyEnabled; // 0x619            
            bool m_bGPUCullSkybox; // 0x61a            
            uint8_t _pad061b[0x1]; // 0x61b
            float m_flEnvRainStrength; // 0x61c            
            float m_flEnvPuddleRippleStrength; // 0x620            
            float m_flEnvPuddleRippleDirection; // 0x624            
            float m_flEnvWetnessCoverage; // 0x628            
            float m_flEnvWetnessDryingAmount; // 0x62c            
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CMapInfo because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::client::CMapInfo) == 0x630);
    };
};
