#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/server/CPointEntity.hpp"

// /////////////////////////////////////////////////////////////
// Module: server
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace server
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x4d8
        // Has VTable
        // Construct allowed
        // MClassHasEntityLimitedDataDesc
        #pragma pack(push, 1)
        class CMapInfo : public source2sdk::server::CPointEntity
        {
        public:
            std::int32_t m_iBuyingStatus; // 0x4a8            
            float m_flBombRadius; // 0x4ac            
            std::int32_t m_iPetPopulation; // 0x4b0            
            bool m_bUseNormalSpawnsForDM; // 0x4b4            
            bool m_bDisableAutoGeneratedDMSpawns; // 0x4b5            
            uint8_t _pad04b6[0x2]; // 0x4b6
            float m_flBotMaxVisionDistance; // 0x4b8            
            std::int32_t m_iHostageCount; // 0x4bc            
            bool m_bFadePlayerVisibilityFarZ; // 0x4c0            
            bool m_bRainTraceToSkyEnabled; // 0x4c1            
            bool m_bGPUCullSkybox; // 0x4c2            
            uint8_t _pad04c3[0x1]; // 0x4c3
            float m_flEnvRainStrength; // 0x4c4            
            float m_flEnvPuddleRippleStrength; // 0x4c8            
            float m_flEnvPuddleRippleDirection; // 0x4cc            
            float m_flEnvWetnessCoverage; // 0x4d0            
            float m_flEnvWetnessDryingAmount; // 0x4d4            
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CMapInfo because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::server::CMapInfo) == 0x4d8);
    };
};
