#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/client/C_PointEntity.hpp"
#include "source2sdk/client/C_SceneEntity_QueuedEvents_t.hpp"
namespace source2sdk
{
    namespace client
    {
        struct C_BaseModelEntity;
    };
};

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace client
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x658
        // Has VTable
        // 
        // static metadata: MNetworkVarNames "bool m_bIsPlayingBack"
        // static metadata: MNetworkVarNames "bool m_bPaused"
        // static metadata: MNetworkVarNames "bool m_bMultiplayer"
        // static metadata: MNetworkVarNames "bool m_bAutogenerated"
        // static metadata: MNetworkVarNames "bool m_bAllRequirementsComplete"
        // static metadata: MNetworkVarNames "float32 m_flForceClientTime"
        // static metadata: MNetworkVarNames "uint16 m_nSceneStringIndex"
        // static metadata: MNetworkVarNames "CHandle< C_BaseModelEntity > m_hActorList"
        #pragma pack(push, 1)
        class C_SceneEntity : public source2sdk::client::C_PointEntity
        {
        public:
            uint8_t _pad05f0[0x8]; // 0x5f0
            // metadata: MNetworkEnable
            // metadata: MNotSaved
            bool m_bIsPlayingBack; // 0x5f8            
            // metadata: MNetworkEnable
            // metadata: MNotSaved
            bool m_bPaused; // 0x5f9            
            // metadata: MNetworkEnable
            // metadata: MNotSaved
            bool m_bMultiplayer; // 0x5fa            
            // metadata: MNetworkEnable
            // metadata: MNotSaved
            bool m_bAutogenerated; // 0x5fb            
            // metadata: MNetworkEnable
            // metadata: MNotSaved
            bool m_bAllRequirementsComplete; // 0x5fc            
            uint8_t _pad05fd[0x3]; // 0x5fd
            // metadata: MNetworkEnable
            // metadata: MNetworkChangeCallback "OnResetClientTime"
            // metadata: MNotSaved
            float m_flForceClientTime; // 0x600            
            // metadata: MNetworkEnable
            // metadata: MNetworkPriority "32"
            // metadata: MNotSaved
            std::uint16_t m_nSceneStringIndex; // 0x604            
            // metadata: MNotSaved
            bool m_bClientOnly; // 0x606            
            uint8_t _pad0607[0x1]; // 0x607
            // metadata: MNotSaved
            // m_hOwner has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::client::C_BaseModelEntity> m_hOwner;
            char m_hOwner[0x4]; // 0x608            
            uint8_t _pad060c[0x4]; // 0x60c
            // metadata: MNetworkEnable
            // metadata: MNetworkPriority "32"
            // metadata: MNotSaved
            // m_hActorList has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // C_NetworkUtlVectorBase<CHandle<source2sdk::client::C_BaseModelEntity>> m_hActorList;
            char m_hActorList[0x18]; // 0x610            
            // metadata: MNotSaved
            bool m_bWasPlaying; // 0x628            
            uint8_t _pad0629[0xf]; // 0x629
            // metadata: MNotSaved
            // m_QueuedEvents has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<source2sdk::client::C_SceneEntity_QueuedEvents_t> m_QueuedEvents;
            char m_QueuedEvents[0x18]; // 0x638            
            // metadata: MNotSaved
            float m_flCurrentTime; // 0x650            
            uint8_t _pad0654[0x4];
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in C_SceneEntity because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::client::C_SceneEntity) == 0x658);
    };
};
