#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/entity2/CEntityIOOutput.hpp"
#include "source2sdk/server/ActorMapping_t.hpp"
#include "source2sdk/server/CPointEntity.hpp"
#include "source2sdk/server/SceneOnPlayerDeath_t.hpp"
namespace source2sdk
{
    namespace server
    {
        struct CBaseEntity;
    };
};
namespace source2sdk
{
    namespace server
    {
        struct CBaseModelEntity;
    };
};
namespace source2sdk
{
    namespace server
    {
        struct CSceneListManager;
    };
};

// /////////////////////////////////////////////////////////////
// Module: server
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace server
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x7e0
        // Has VTable
        // Construct allowed
        #pragma pack(push, 1)
        class CSceneEntity : public source2sdk::server::CPointEntity
        {
        public:
            uint8_t _pad0498[0x8]; // 0x498
            CUtlSymbolLarge m_iszSceneFile; // 0x4a0            
            CUtlSymbolLarge m_iszTarget1; // 0x4a8            
            CUtlSymbolLarge m_iszTarget2; // 0x4b0            
            CUtlSymbolLarge m_iszTarget3; // 0x4b8            
            CUtlSymbolLarge m_iszTarget4; // 0x4c0            
            CUtlSymbolLarge m_iszTarget5; // 0x4c8            
            CUtlSymbolLarge m_iszTarget6; // 0x4d0            
            CUtlSymbolLarge m_iszTarget7; // 0x4d8            
            CUtlSymbolLarge m_iszTarget8; // 0x4e0            
            // m_hTarget1 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget1;
            char m_hTarget1[0x4]; // 0x4e8            
            // m_hTarget2 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget2;
            char m_hTarget2[0x4]; // 0x4ec            
            // m_hTarget3 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget3;
            char m_hTarget3[0x4]; // 0x4f0            
            // m_hTarget4 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget4;
            char m_hTarget4[0x4]; // 0x4f4            
            // m_hTarget5 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget5;
            char m_hTarget5[0x4]; // 0x4f8            
            // m_hTarget6 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget6;
            char m_hTarget6[0x4]; // 0x4fc            
            // m_hTarget7 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget7;
            char m_hTarget7[0x4]; // 0x500            
            // m_hTarget8 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget8;
            char m_hTarget8[0x4]; // 0x504            
            // m_hLocatorOrigin has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hLocatorOrigin;
            char m_hLocatorOrigin[0x4]; // 0x508            
            uint8_t _pad050c[0x4]; // 0x50c
            CUtlSymbolLarge m_sTargetAttachment; // 0x510            
            bool m_bIsPlayingBack; // 0x518            
            bool m_bPaused; // 0x519            
            bool m_bMultiplayer; // 0x51a            
            bool m_bAutogenerated; // 0x51b            
            float m_flForceClientTime; // 0x51c            
            float m_flCurrentTime; // 0x520            
            float m_flFrameTime; // 0x524            
            bool m_bCancelAtNextInterrupt; // 0x528            
            uint8_t _pad0529[0x3]; // 0x529
            float m_fPitch; // 0x52c            
            bool m_bAutomated; // 0x530            
            uint8_t _pad0531[0x3]; // 0x531
            std::int32_t m_nAutomatedAction; // 0x534            
            float m_flAutomationDelay; // 0x538            
            float m_flAutomationTime; // 0x53c            
            std::int32_t m_nSpeechPriority; // 0x540            
            bool m_bPausedViaInput; // 0x544            
            bool m_bPauseAtNextInterrupt; // 0x545            
            bool m_bWaitingForActor; // 0x546            
            bool m_bWaitingForInterrupt; // 0x547            
            bool m_bInterruptedActorsScenes; // 0x548            
            bool m_bBreakOnNonIdle; // 0x549            
            bool m_bSceneFinished; // 0x54a            
            uint8_t _pad054b[0x5]; // 0x54b
            // m_hActorList has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CNetworkUtlVectorBase<CHandle<source2sdk::server::CBaseModelEntity>> m_hActorList;
            char m_hActorList[0x18]; // 0x550            
            // m_hRemoveActorList has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<CHandle<source2sdk::server::CBaseEntity>> m_hRemoveActorList;
            char m_hRemoveActorList[0x18]; // 0x568            
            uint8_t _pad0580[0x30]; // 0x580
            // metadata: MNotSaved
            std::uint16_t m_nSceneStringIndex; // 0x5b0            
            uint8_t _pad05b2[0x6]; // 0x5b2
            source2sdk::entity2::CEntityIOOutput m_OnStart; // 0x5b8            
            source2sdk::entity2::CEntityIOOutput m_OnCompletion; // 0x5d0            
            source2sdk::entity2::CEntityIOOutput m_OnCanceled; // 0x5e8            
            source2sdk::entity2::CEntityIOOutput m_OnPaused; // 0x600            
            source2sdk::entity2::CEntityIOOutput m_OnResumed; // 0x618            
            source2sdk::entity2::CEntityIOOutput m_OnPulseRequirement; // 0x630            
            uint8_t _pad0648[0xf0]; // 0x648
            // m_ActorMap has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<source2sdk::server::ActorMapping_t> m_ActorMap;
            char m_ActorMap[0x18]; // 0x738            
            uint8_t _pad0750[0x28]; // 0x750
            // m_hInterruptScene has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CSceneEntity> m_hInterruptScene;
            char m_hInterruptScene[0x4]; // 0x778            
            std::int32_t m_nInterruptCount; // 0x77c            
            // metadata: MNotSaved
            bool m_bSceneMissing; // 0x780            
            bool m_bInterrupted; // 0x781            
            bool m_bCompletedEarly; // 0x782            
            bool m_bInterruptSceneFinished; // 0x783            
            // metadata: MNotSaved
            bool m_bRestoring; // 0x784            
            uint8_t _pad0785[0x3]; // 0x785
            // m_hNotifySceneCompletion has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<CHandle<source2sdk::server::CSceneEntity>> m_hNotifySceneCompletion;
            char m_hNotifySceneCompletion[0x18]; // 0x788            
            // m_hListManagers has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<CHandle<source2sdk::server::CSceneListManager>> m_hListManagers;
            char m_hListManagers[0x18]; // 0x7a0            
            CUtlSymbolLarge m_iszSoundName; // 0x7b8            
            CUtlSymbolLarge m_iszSequenceName; // 0x7c0            
            // m_hActor has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseModelEntity> m_hActor;
            char m_hActor[0x4]; // 0x7c8            
            // m_hActivator has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hActivator;
            char m_hActivator[0x4]; // 0x7cc            
            std::int32_t m_BusyActor; // 0x7d0            
            source2sdk::server::SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0x7d4            
            uint8_t _pad07d8[0x8];
            
            // Datamap fields:
            // void InputStartPlayback; // 0x0
            // void InputPausePlayback; // 0x0
            // void InputResumePlayback; // 0x0
            // void InputCancelPlayback; // 0x0
            // void InputCancelAtNextInterrupt; // 0x0
            // float InputPitchShiftPlayback; // 0x0
            // CUtlSymbolLarge InputInterjectResponse; // 0x0
            // void InputStopWaitingForActor; // 0x0
            // CUtlSymbolLarge InputSetTarget1; // 0x0
            // CUtlSymbolLarge InputSetTarget2; // 0x0
            // void InputScriptPlayerDeath; // 0x0
            // void InputPauseAtNextInterrupt; // 0x0
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CSceneEntity because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::server::CSceneEntity) == 0x7e0);
    };
};
