#pragma once

#include "source2sdk/source2gen/source2gen.hpp"
#include <cstddef>
#include <cstdint>
#include "source2sdk/entity2/CEntityIOOutput.hpp"
#include "source2sdk/server/CPointEntity.hpp"
#include "source2sdk/server/SceneOnPlayerDeath_t.hpp"
namespace source2sdk
{
    namespace server
    {
        struct CBaseEntity;
    };
};
namespace source2sdk
{
    namespace server
    {
        struct CBaseModelEntity;
    };
};
namespace source2sdk
{
    namespace server
    {
        struct CSceneListManager;
    };
};

// /////////////////////////////////////////////////////////////
// Module: server
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk
{
    namespace server
    {
        // Registered alignment: 0x8
        // Alignment: 0x8
        // Standard-layout class: false
        // Size: 0x790
        // Has VTable
        // 
        // static metadata: MNetworkVarNames "bool m_bIsPlayingBack"
        // static metadata: MNetworkVarNames "bool m_bPaused"
        // static metadata: MNetworkVarNames "bool m_bMultiplayer"
        // static metadata: MNetworkVarNames "bool m_bAutogenerated"
        // static metadata: MNetworkVarNames "bool m_bAllRequirementsComplete"
        // static metadata: MNetworkVarNames "float32 m_flForceClientTime"
        // static metadata: MNetworkVarNames "CHandle< CBaseModelEntity > m_hActorList"
        // static metadata: MNetworkVarNames "uint16 m_nSceneStringIndex"
        #pragma pack(push, 1)
        class CSceneEntity : public source2sdk::server::CPointEntity
        {
        public:
            uint8_t _pad04a0[0x8]; // 0x4a0
            CUtlSymbolLarge m_iszSceneFile; // 0x4a8            
            CUtlSymbolLarge m_iszTarget1; // 0x4b0            
            CUtlSymbolLarge m_iszTarget2; // 0x4b8            
            CUtlSymbolLarge m_iszTarget3; // 0x4c0            
            CUtlSymbolLarge m_iszTarget4; // 0x4c8            
            CUtlSymbolLarge m_iszTarget5; // 0x4d0            
            CUtlSymbolLarge m_iszTarget6; // 0x4d8            
            CUtlSymbolLarge m_iszTarget7; // 0x4e0            
            CUtlSymbolLarge m_iszTarget8; // 0x4e8            
            // m_hTarget1 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget1;
            char m_hTarget1[0x4]; // 0x4f0            
            // m_hTarget2 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget2;
            char m_hTarget2[0x4]; // 0x4f4            
            // m_hTarget3 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget3;
            char m_hTarget3[0x4]; // 0x4f8            
            // m_hTarget4 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget4;
            char m_hTarget4[0x4]; // 0x4fc            
            // m_hTarget5 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget5;
            char m_hTarget5[0x4]; // 0x500            
            // m_hTarget6 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget6;
            char m_hTarget6[0x4]; // 0x504            
            // m_hTarget7 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget7;
            char m_hTarget7[0x4]; // 0x508            
            // m_hTarget8 has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hTarget8;
            char m_hTarget8[0x4]; // 0x50c            
            // m_hLocatorOrigin has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hLocatorOrigin;
            char m_hLocatorOrigin[0x4]; // 0x510            
            uint8_t _pad0514[0x4]; // 0x514
            CUtlSymbolLarge m_sTargetAttachment; // 0x518            
            // metadata: MNetworkEnable
            bool m_bIsPlayingBack; // 0x520            
            // metadata: MNetworkEnable
            bool m_bPaused; // 0x521            
            // metadata: MNetworkEnable
            bool m_bMultiplayer; // 0x522            
            // metadata: MNetworkEnable
            bool m_bAutogenerated; // 0x523            
            // metadata: MNetworkEnable
            bool m_bAllRequirementsComplete; // 0x524            
            uint8_t _pad0525[0x3]; // 0x525
            // metadata: MNetworkEnable
            float m_flForceClientTime; // 0x528            
            float m_flCurrentTime; // 0x52c            
            float m_flFrameTime; // 0x530            
            bool m_bCancelAtNextInterrupt; // 0x534            
            uint8_t _pad0535[0x3]; // 0x535
            float m_fPitch; // 0x538            
            bool m_bAutomated; // 0x53c            
            uint8_t _pad053d[0x3]; // 0x53d
            std::int32_t m_nAutomatedAction; // 0x540            
            float m_flAutomationDelay; // 0x544            
            float m_flAutomationTime; // 0x548            
            std::int32_t m_nSpeechPriority; // 0x54c            
            bool m_bPausedViaInput; // 0x550            
            bool m_bPauseAtNextInterrupt; // 0x551            
            bool m_bWaitingForActor; // 0x552            
            bool m_bWaitingForInterrupt; // 0x553            
            bool m_bInterruptedActorsScenes; // 0x554            
            bool m_bTakeOverNPCBehavior; // 0x555            
            bool m_bBreakOnNonIdle; // 0x556            
            bool m_bSceneFinished; // 0x557            
            // metadata: MNetworkEnable
            // m_hActorList has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CNetworkUtlVectorBase<CHandle<source2sdk::server::CBaseModelEntity>> m_hActorList;
            char m_hActorList[0x18]; // 0x558            
            // m_hRemoveActorList has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<CHandle<source2sdk::server::CBaseEntity>> m_hRemoveActorList;
            char m_hRemoveActorList[0x18]; // 0x570            
            uint8_t _pad0588[0x30]; // 0x588
            // metadata: MNetworkEnable
            // metadata: MNotSaved
            std::uint16_t m_nSceneStringIndex; // 0x5b8            
            uint8_t _pad05ba[0x6]; // 0x5ba
            source2sdk::entity2::CEntityIOOutput m_OnStart; // 0x5c0            
            source2sdk::entity2::CEntityIOOutput m_OnCompletion; // 0x5d8            
            source2sdk::entity2::CEntityIOOutput m_OnCanceled; // 0x5f0            
            source2sdk::entity2::CEntityIOOutput m_OnPaused; // 0x608            
            source2sdk::entity2::CEntityIOOutput m_OnResumed; // 0x620            
            uint8_t _pad0638[0xf0]; // 0x638
            // m_hInterruptScene has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CSceneEntity> m_hInterruptScene;
            char m_hInterruptScene[0x4]; // 0x728            
            std::int32_t m_nInterruptCount; // 0x72c            
            // metadata: MNotSaved
            bool m_bSceneMissing; // 0x730            
            bool m_bInterrupted; // 0x731            
            bool m_bCompletedEarly; // 0x732            
            bool m_bInterruptSceneFinished; // 0x733            
            // metadata: MNotSaved
            bool m_bRestoring; // 0x734            
            uint8_t _pad0735[0x3]; // 0x735
            // m_hNotifySceneCompletion has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<CHandle<source2sdk::server::CSceneEntity>> m_hNotifySceneCompletion;
            char m_hNotifySceneCompletion[0x18]; // 0x738            
            // m_hListManagers has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CUtlVector<CHandle<source2sdk::server::CSceneListManager>> m_hListManagers;
            char m_hListManagers[0x18]; // 0x750            
            CUtlSymbolLarge m_iszSoundName; // 0x768            
            CUtlSymbolLarge m_iszSequenceName; // 0x770            
            // m_hActor has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseModelEntity> m_hActor;
            char m_hActor[0x4]; // 0x778            
            // m_hActivator has a template type with potentially unknown template parameters. You can try uncommenting the field below.
            // CHandle<source2sdk::server::CBaseEntity> m_hActivator;
            char m_hActivator[0x4]; // 0x77c            
            std::int32_t m_BusyActor; // 0x780            
            source2sdk::server::SceneOnPlayerDeath_t m_iPlayerDeathBehavior; // 0x784            
            uint8_t _pad0788[0x8];
            
            // Datamap fields:
            // void m_pScene; // 0x5b0
            // void m_pRecipientFilter; // 0x788
            // void InputStartPlayback; // 0x0
            // void InputPausePlayback; // 0x0
            // void InputResumePlayback; // 0x0
            // void InputCancelPlayback; // 0x0
            // void InputCancelAtNextInterrupt; // 0x0
            // float InputPitchShiftPlayback; // 0x0
            // CUtlSymbolLarge InputInterjectResponse; // 0x0
            // void InputStopWaitingForActor; // 0x0
            // CUtlSymbolLarge InputSetTarget1; // 0x0
            // CUtlSymbolLarge InputSetTarget2; // 0x0
            // void InputScriptPlayerDeath; // 0x0
            // void InputPauseAtNextInterrupt; // 0x0
        };
        #pragma pack(pop)
        
        // Cannot assert offsets of fields in CSceneEntity because it is not a standard-layout class
        
        static_assert(sizeof(source2sdk::server::CSceneEntity) == 0x790);
    };
};
